---
kind: property
id: P:Autodesk.Revit.DB.ElevationMarker.IsReference
source: html/d414ea87-a529-54a3-a2e9-0df0102214c0.htm
---
# Autodesk.Revit.DB.ElevationMarker.IsReference Property

Indicates if this is a reference ElevationMarker.
 Only reference elevations can be hosted by reference ElevationMarkers.

## Syntax (C#)
```csharp
public bool IsReference { get; }
```